In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = pd.DataFrame({
    'Customer': ['a','b','c','a','c','d'],
    'Date': ['2024-01-20','2024-01-25','2024-01-31','2024-01-01','2024-01-12','2024-01-17'],
    'Amount': [100,5000,200,1000,600,700]
    })
data

  Customer        Date  Amount
0        a  2024-01-20     100
1        b  2024-01-25    5000
2        c  2024-01-31     200
3        a  2024-01-01    1000
4        c  2024-01-12     600
5        d  2024-01-17     700

In [5]:
data['Date'] = pd.to_datetime(data['Date'])
data

  Customer       Date  Amount
0        a 2024-01-20     100
1        b 2024-01-25    5000
2        c 2024-01-31     200
3        a 2024-01-01    1000
4        c 2024-01-12     600
5        d 2024-01-17     700

In [6]:
data.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Customer  6 non-null      str
 1   Date      6 non-null      datetime64[us]
 2   Amount    6 non-null      int64
dtypes: datetime64[us](1), int64(1), str(1)
memory usage: 276.0 bytes

In [ ]:
rfm = data.groupby('Customer').agg({'Date': lambda x: (pd.to_datetime('2024-02-01') - x.max()).days, 'Customer': 'count', 'Amount': 'sum'})

In [11]:
rfm.columns = ['Recency','Frequency','Monetary']
rfm

          Recency  Frequency  Monetary
Customer
a              12          2      1100
b               7          1      5000
c               1          2       800
d              15          1       700

In [13]:
rfm['R_score'] = pd.qcut(rfm['Recency'],q=3,labels = [3,2,1])
rfm['F_score'] = pd.qcut(rfm['Frequency'].rank(method = 'first'),q=3,labels = [1,2,3])
rfm['M_score'] = pd.qcut(rfm['Monetary'],q=3,labels = [1,2,3])

In [14]:
rfm

          Recency  Frequency  Monetary R_score F_score M_score
Customer
a              12          2      1100       2       2       2
b               7          1      5000       3       1       3
c               1          2       800       3       3       1
d              15          1       700       1       1       1

In [17]:
rfm['RFM_Group'] = rfm['R_score'].astype(str) + rfm['F_score'].astype(str) + rfm['M_score'].astype(str)
rfm

          Recency  Frequency  Monetary R_score F_score M_score RFM_Group
Customer
a              12          2      1100       2       2       2       222
b               7          1      5000       3       1       3       313
c               1          2       800       3       3       1       331
d              15          1       700       1       1       1       111